In [5]:
# series 
import pandas as pd
obj=pd.Series([1,2,3,4],index=['Ratnesh','divesh','sai','golu'])
obj

Ratnesh    1
divesh     2
sai        3
golu       4
dtype: int64

In [8]:
obj[1:3]

divesh    2
sai       3
dtype: int64

In [10]:
obj['sai']

3

In [14]:
obj2 = pd.Series([4, 7, -5, 3])
obj2

0    4
1    7
2   -5
3    3
dtype: int64

In [57]:
#sorting 
obj2.sort_index() #for ascending order

0    4
1    7
2   -5
3    3
dtype: int64

In [60]:
obj2.sort_index(ascending=False) #for descending order

3    3
2   -5
1    7
0    4
dtype: int64

In [61]:
#ranking
print(obj2.rank())

0    3.0
1    4.0
2    1.0
3    2.0
dtype: float64

In [16]:
# to take log import numpy
import numpy as np
np.log(obj2)

0    1.386294
1    1.945910
2         NaN
3    1.098612
dtype: float64

In [20]:
int1=pd.Series([10,20,30],index=["c","a","b"])
int2=pd.Series([20,30,40],index=["a","b","d"])

In [22]:
# now joining this two array 
int=int1+int2

In [32]:
# Constructing Data Frame using Dictionary
data = pd.DataFrame({'State': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'Year': [2000, 2001, 2002, 2001, 2002, 2003],
        'Pop': [1.5, 1.7, np.nan, 2.4, 2.9, 3.2]})
data

    State  Year  Pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  NaN
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [37]:
# Join dataframes
left = pd.DataFrame({"Date":[1,2,3],
 "B":[3,4,5]})
right = pd.DataFrame({"Date":[1,3,4],
 "D":[3,4,6]})
print("Left\n",left) # to print left data frame
print("Right\n",right) # to print right data frame
pd.merge(left,right,on="Date") # merge on "Date"

Left
    Date  B
0     1  3
1     2  4
2     3  5
Right
    Date  D
0     1  3
1     3  4
2     4  6

   Date  B  D
0     1  3  3
1     3  5  4

In [40]:
# Grouping
df = pd.DataFrame({"Gender": ["M", "F"]*4,
 "Smoke": ["Smoker", "NonSmoker", "NonSmoker", "Smoker"]*2,   # this mulitply by 2 gives this whole string 2 times
 "ConcA": np.random.randint(1,10,8),
 "ConcB": np.random.randint(1,10,8)})
df

  Gender      Smoke  ConcA  ConcB
0      M     Smoker      3      3
1      F  NonSmoker      1      8
2      M  NonSmoker      1      6
3      F     Smoker      7      7
4      M     Smoker      8      6
5      F  NonSmoker      4      7
6      M  NonSmoker      2      6
7      F     Smoker      8      4

In [43]:
df.groupby(["Gender","Smoke"]).describe()

                 ConcA                                           ConcB       \
                 count mean       std  min   25%  50%   75%  max count mean
Gender Smoke
F      NonSmoker   2.0  2.5  2.121320  1.0  1.75  2.5  3.25  4.0   2.0  7.5
       Smoker      2.0  7.5  0.707107  7.0  7.25  7.5  7.75  8.0   2.0  5.5
M      NonSmoker   2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   2.0  6.0
       Smoker      2.0  5.5  3.535534  3.0  4.25  5.5  6.75  8.0   2.0  4.5


                       std  min   25%  50%   75%  max
Gender Smoke
F      NonSmoker  0.707107  7.0  7.25  7.5  7.75  8.0
       Smoker     2.121320  4.0  4.75  5.5  6.25  7.0
M      NonSmoker  0.000000  6.0  6.00  6.0  6.00  6.0
       Smoker     2.121320  3.0  3.75  4.5  5.25  6.0

In [45]:
df.groupby("Gender").mean()

C:\Users\ratne\AppData\Local\Temp\ipykernel_492\1514436764.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("Gender").mean()

        ConcA  ConcB
Gender
F         5.0   6.50
M         3.5   5.25

In [49]:
df2=df.iloc[:,2:] #gives all rows and columns after 3rd colmum
df2

   ConcA  ConcB
0      3      3
1      1      8
2      1      6
3      7      7
4      8      6
5      4      7
6      2      6
7      8      4

In [56]:
df2.apply(sum,axis=0) # colum Sum

ConcA    34
ConcB    47
dtype: int64

In [55]:
df2.apply(sum,axis=1) # row Sum

0     6
1     9
2     7
3    14
4    14
5    11
6     8
7    12
dtype: int64